
var symbolCode = [24, 28, 29, 31, 34, 410, 32, 590, 360
    , 390, 400, 350, 26, 370, 380, 44, 48, 320
    , 1019, 1022,1024,321,1023,1025
    ,1013, 1014, 1016, 1017,1026
    ,1001, 1003, 1004,1028];
var symbolName = ["折线", "平行四边形", "圆", "椭圆", "注记", "正多边形", "多边形", "贝赛尔曲线", "闭合贝赛尔曲线"
    , "集结地", "大括号", "梯形", "矩形", "弓形", "扇形", "弧线", "平行线", "注记指示框"
    , "同心圆", "组合圆","标注框","多角标注框","自由线",  "节点链"
    , "跑道形", "八字形", "箭头线", "沿线注记","线型标注"
    , "对象间连线", "多边形区域","扇形区域","铁丝网"];

const basics = symbolCode.map((symbolCode, i)=>{
  return {
    symbolCode: symbolCode,
    symbolName: symbolName[i],
    libID: 0,
    img: `/static/images/map/basic/${symbolCode}.png`
  }
});

export {
  basics
}
